In [1]:
import pandas as pd

## Excel'i Okuma

In [2]:
pd.read_excel("maasBilgisi.xlsx")

  Unnamed: 0  Maas   Yas  Departman
0       Atıl   100  40.0    Yazılım
1     Zeynep   200  50.0      Satış
2     Mehmet   300  60.0        NaN
3      Ahmet   400  70.0  Pazarlama
4      Atlas   500   NaN     Finans
5      Fatma   600  90.0  Pazarlama

In [3]:
dataFrame = pd.read_excel("maasBilgisi.xlsx")

In [4]:
dataFrame

  Unnamed: 0  Maas   Yas  Departman
0       Atıl   100  40.0    Yazılım
1     Zeynep   200  50.0      Satış
2     Mehmet   300  60.0        NaN
3      Ahmet   400  70.0  Pazarlama
4      Atlas   500   NaN     Finans
5      Fatma   600  90.0  Pazarlama

In [6]:
doluDegerler = dataFrame.dropna()

In [7]:
doluDegerler

  Unnamed: 0  Maas   Yas  Departman
0       Atıl   100  40.0    Yazılım
1     Zeynep   200  50.0      Satış
3      Ahmet   400  70.0  Pazarlama
5      Fatma   600  90.0  Pazarlama

In [8]:
dataFrame

  Unnamed: 0  Maas   Yas  Departman
0       Atıl   100  40.0    Yazılım
1     Zeynep   200  50.0      Satış
2     Mehmet   300  60.0        NaN
3      Ahmet   400  70.0  Pazarlama
4      Atlas   500   NaN     Finans
5      Fatma   600  90.0  Pazarlama

## Excel Dosyası Oluşturma

In [10]:
doluDegerler.to_excel("tamMaas.xlsx")

## Diğer Dosya Tipleri

In [11]:
## read_csv
## to_csv